Tekla.Structures.DirectManipulation.Adapter.State.ICollectionState`1
The Tekla.Structures.DirectManipulation.Adapter.State.ICollectionState`1 interface provides an interface for managing the state based on the collection of objects.
The type of the objects in the collection.

Tekla.Structures.DirectManipulation.Adapter.State.ICollectionState`1.LastState
Gets the last state of the object collection.

Tekla.Structures.DirectManipulation.Adapter.State.ICollectionState`1.Update(System.Collections.Generic.ICollection{`0},System.Boolean)
Updates the state of the object collection.
newCollection: The new object collections.
forceUpdate: A value indicating whether to update the state even if there is no change.
Returns: True if the state was updated; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.ICollectionState`1.IsChanged(System.Collections.Generic.ICollection{`0})
Checks if the state of the object collection has been changed.
newCollection: The new object collection.
Returns: True if there is any change in the object collection state; otherwise, false.